app/views/movies/index.html.erb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date
---
      <th class = "<%= @title_highlight %>" id="title_header">
        <%= link_to "Movie Title", movies_path({:sort => {:title => 1}, :ratings => Hash[@ratings_to_show.map{|x| [x, 1]}]})%>