app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date
---
  def index
    if params[:ratings] == nil
      params[:ratings] = session[:ratings]
    end
    if params[:sort] == nil
      params[:sort] = session[:sort]
    end
    @all_ratings = Movie.all_ratings
    if params[:ratings].present?
      session[:ratings] = params[:ratings]
      @ratings_to_show = params[:ratings].keys
    else
      @ratings_to_show = @all_ratings
    end

    if params[:sort].present?
      session[:sort] = params[:sort]
      if params[:sort].keys[0] == "title"
        @title_highlight = "hilite bg-warning"
      else
        @date_highlight = "hilite bg-warning"
      end

      @movies = Movie.with_ratings(@ratings_to_show).order(params[:sort].keys[0])